log/SpringWebsocket.log

2018-02-01 09:30:34 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 09:30:34 [main] INFO org.springframework.oxm.jaxb.Jaxb2Marshaller(531) -Creating JAXBContext by scanning packages [com.ynding.entity]
2018-02-01 09:30:35 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 09:30:35 [main] TRACE org.springframework.ws.client.MessageTracing.sent(653) -Sent request [<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:HolidayRequest xmlns:ns2="http://ynding.com/hr/schemas"><ns2:Holiday><ns2:StartDate>2018-02-01T09:30:35.025+08:00</ns2:StartDate><ns2:EndDate>2018-02-01T09:30:35.025+08:00</ns2:EndDate></ns2:Holiday><ns2:Employee><ns2:Number>1</ns2:Number><ns2:FirstName>yn</ns2:FirstName><ns2:LastName>ding</ns2:LastName></ns2:Employee></ns2:HolidayRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>]
2018-02-01 09:31:33 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 09:31:33 [main] INFO org.springframework.oxm.jaxb.Jaxb2Marshaller(531) -Creating JAXBContext by scanning packages [com.ynding.entity]
2018-02-01 09:31:33 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 09:31:34 [main] TRACE org.springframework.ws.client.MessageTracing.sent(653) -Sent request [<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:HolidayRequest xmlns:ns2="http://ynding.com/hr/schemas"><ns2:Holiday><ns2:StartDate>2018-02-01T09:31:33.765+08:00</ns2:StartDate><ns2:EndDate>2018-02-01T09:31:33.765+08:00</ns2:EndDate></ns2:Holiday><ns2:Employee><ns2:Number>1</ns2:Number><ns2:FirstName>yn</ns2:FirstName><ns2:LastName>ding</ns2:LastName></ns2:Employee></ns2:HolidayRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>]
2018-02-01 09:31:36 [main] DEBUG org.springframework.ws.client.MessageTracing.received(715) -Received response [SaajSoapMessage {http://ynding.com/hr/schemas}HolidayResponse] for request [SaajSoapMessage {http://ynding.com/hr/schemas}HolidayRequest]
2018-02-01 09:45:04 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 09:45:04 [main] INFO org.springframework.oxm.jaxb.Jaxb2Marshaller(531) -Creating JAXBContext by scanning packages [com.ynding.entity]
2018-02-01 09:45:05 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 09:45:05 [main] TRACE org.springframework.ws.client.MessageTracing.sent(653) -Sent request [<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:HolidayRequest xmlns:ns2="http://ynding.com/hr/schemas"><ns2:Holiday><ns2:StartDate>2018-02-01T09:45:05.526+08:00</ns2:StartDate><ns2:EndDate>2018-02-01T09:45:05.526+08:00</ns2:EndDate></ns2:Holiday><ns2:Employee><ns2:Number>1</ns2:Number><ns2:FirstName>yn</ns2:FirstName><ns2:LastName>ding</ns2:LastName></ns2:Employee></ns2:HolidayRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>]
2018-02-01 09:45:06 [main] DEBUG org.springframework.ws.client.MessageTracing.received(715) -Received response [SaajSoapMessage {http://ynding.com/hr/schemas}HolidayResponse] for request [SaajSoapMessage {http://ynding.com/hr/schemas}HolidayRequest]
2018-02-01 09:45:16 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 09:45:16 [main] INFO org.springframework.oxm.jaxb.Jaxb2Marshaller(518) -Creating JAXBContext with classes to be bound [class com.ynding.User]
2018-02-01 09:45:16 [main] TRACE org.springframework.ws.client.MessageTracing.sent(653) -Sent request [<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><user><id>1</id><name>chenzhouce</name></user></SOAP-ENV:Body></SOAP-ENV:Envelope>]
2018-02-01 09:45:17 [main] DEBUG org.springframework.ws.client.MessageTracing.received(715) -Received response [SaajSoapMessage user] for request [SaajSoapMessage user]
2018-02-01 09:48:34 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 09:48:34 [main] INFO org.springframework.oxm.jaxb.Jaxb2Marshaller(531) -Creating JAXBContext by scanning packages [com.ynding.entity]
2018-02-01 09:48:34 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 09:48:35 [main] TRACE org.springframework.ws.client.MessageTracing.sent(653) -Sent request [<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:HolidayRequest xmlns:ns2="http://ynding.com/hr/schemas"><ns2:Holiday><ns2:StartDate>2018-02-01T09:48:34.805+08:00</ns2:StartDate><ns2:EndDate>2018-02-01T09:48:34.805+08:00</ns2:EndDate></ns2:Holiday><ns2:Employee><ns2:Number>1</ns2:Number><ns2:FirstName>yn</ns2:FirstName><ns2:LastName>ding</ns2:LastName></ns2:Employee></ns2:HolidayRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>]
2018-02-01 09:48:36 [main] DEBUG org.springframework.ws.client.MessageTracing.received(715) -Received response [SaajSoapMessage {http://ynding.com/hr/schemas}HolidayResponse] for request [SaajSoapMessage {http://ynding.com/hr/schemas}HolidayRequest]
2018-02-01 09:50:19 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 09:50:19 [main] INFO org.springframework.oxm.jaxb.Jaxb2Marshaller(531) -Creating JAXBContext by scanning packages [com.ynding.entity]
2018-02-01 09:50:19 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 09:50:20 [main] TRACE org.springframework.ws.client.MessageTracing.sent(653) -Sent request [<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:HolidayRequest xmlns:ns2="http://ynding.com/hr/schemas"><ns2:Holiday><ns2:StartDate>2018-02-01T09:50:19.711+08:00</ns2:StartDate><ns2:EndDate>2018-02-01T09:50:19.711+08:00</ns2:EndDate></ns2:Holiday><ns2:Employee><ns2:Number>1</ns2:Number><ns2:FirstName>yn</ns2:FirstName><ns2:LastName>ding</ns2:LastName></ns2:Employee></ns2:HolidayRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>]
2018-02-01 09:50:20 [main] DEBUG org.springframework.ws.client.MessageTracing.received(715) -Received response [SaajSoapMessage {http://ynding.com/hr/schemas}HolidayResponse] for request [SaajSoapMessage {http://ynding.com/hr/schemas}HolidayRequest]
2018-02-01 09:50:20 [main] TRACE org.springframework.ws.client.MessageTracing.sent(653) -Sent request [<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><HolidayRequest xmlns="http://ynding.com/hr/schemas">
	<Holiday>
		<StartDate>2006-07-03</StartDate>
		<EndDate>2006-07-07</EndDate>
	</Holiday>
	<Employee>
		<Number>42</Number>
		<FirstName>Arjen</FirstName>
		<LastName>Poutsma</LastName>
	</Employee>
</HolidayRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>]
2018-02-01 09:50:20 [main] DEBUG org.springframework.ws.client.MessageTracing.received(715) -Received response [SaajSoapMessage {http://ynding.com/hr/schemas}HolidayResponse] for request [SaajSoapMessage {http://ynding.com/hr/schemas}HolidayRequest]
2018-02-01 10:07:04 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 10:07:04 [main] INFO org.springframework.oxm.jaxb.Jaxb2Marshaller(518) -Creating JAXBContext with classes to be bound [class com.ynding.entity.User]
2018-02-01 10:07:04 [main] TRACE org.springframework.ws.client.MessageTracing.sent(653) -Sent request [<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:user xmlns:ns2="http://ynding.com/hr/schemas"><ns2:id>1</ns2:id><ns2:name>chenzhouce</ns2:name></ns2:user></SOAP-ENV:Body></SOAP-ENV:Envelope>]
2018-02-01 10:08:57 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 10:08:57 [main] INFO org.springframework.oxm.jaxb.Jaxb2Marshaller(518) -Creating JAXBContext with classes to be bound [class com.ynding.entity.User]
2018-02-01 10:08:57 [main] TRACE org.springframework.ws.client.MessageTracing.sent(653) -Sent request [<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:user xmlns:ns2="http://ynding.com/hr/schemas"><ns2:id>1</ns2:id><ns2:name>chenzhouce</ns2:name></ns2:user></SOAP-ENV:Body></SOAP-ENV:Envelope>]
2018-02-01 10:13:28 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 10:13:28 [main] INFO org.springframework.oxm.jaxb.Jaxb2Marshaller(518) -Creating JAXBContext with classes to be bound [class com.ynding.entity.User]
2018-02-01 10:13:28 [main] TRACE org.springframework.ws.client.MessageTracing.sent(653) -Sent request [<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:user xmlns:ns2="http://ynding.com/hr/schemas"><ns2:id>1</ns2:id><ns2:name>chenzhouce</ns2:name></ns2:user></SOAP-ENV:Body></SOAP-ENV:Envelope>]
2018-02-01 10:13:39 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 10:13:57 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 10:13:58 [main] INFO org.springframework.oxm.jaxb.Jaxb2Marshaller(518) -Creating JAXBContext with classes to be bound [class com.ynding.entity.User]
2018-02-01 10:13:58 [main] TRACE org.springframework.ws.client.MessageTracing.sent(653) -Sent request [<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:user xmlns:ns2="http://ynding.com/hr/schemas"><ns2:id>1</ns2:id><ns2:name>chenzhouce</ns2:name></ns2:user></SOAP-ENV:Body></SOAP-ENV:Envelope>]
2018-02-01 10:15:37 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 10:15:37 [main] INFO org.springframework.oxm.jaxb.Jaxb2Marshaller(518) -Creating JAXBContext with classes to be bound [class com.ynding.entity.User]
2018-02-01 10:15:37 [main] TRACE org.springframework.ws.client.MessageTracing.sent(653) -Sent request [<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:user xmlns:ns2="http://ynding.com/hr/schemas"><ns2:id>1</ns2:id><ns2:name>chenzhouce</ns2:name></ns2:user></SOAP-ENV:Body></SOAP-ENV:Envelope>]
2018-02-01 10:16:59 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 10:16:59 [main] INFO org.springframework.oxm.jaxb.Jaxb2Marshaller(531) -Creating JAXBContext by scanning packages [com.ynding.entity]
2018-02-01 10:17:00 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 10:17:00 [main] TRACE org.springframework.ws.client.MessageTracing.sent(653) -Sent request [<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:HolidayRequest xmlns:ns2="http://ynding.com/hr/schemas"><ns2:Holiday><ns2:StartDate>2018-02-01T10:17:00.081+08:00</ns2:StartDate><ns2:EndDate>2018-02-01T10:17:00.081+08:00</ns2:EndDate></ns2:Holiday><ns2:Employee><ns2:Number>1</ns2:Number><ns2:FirstName>yn</ns2:FirstName><ns2:LastName>ding</ns2:LastName></ns2:Employee></ns2:HolidayRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>]
2018-02-01 10:17:00 [main] DEBUG org.springframework.ws.client.MessageTracing.received(715) -Received response [SaajSoapMessage {http://ynding.com/hr/schemas}HolidayResponse] for request [SaajSoapMessage {http://ynding.com/hr/schemas}HolidayRequest]
2018-02-01 10:17:00 [main] TRACE org.springframework.ws.client.MessageTracing.sent(653) -Sent request [<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><HolidayRequest xmlns="http://ynding.com/hr/schemas">
	<Holiday>
		<StartDate>2006-07-03</StartDate>
		<EndDate>2006-07-07</EndDate>
	</Holiday>
	<Employee>
		<Number>42</Number>
		<FirstName>Arjen</FirstName>
		<LastName>Poutsma</LastName>
	</Employee>
</HolidayRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>]
2018-02-01 10:17:00 [main] DEBUG org.springframework.ws.client.MessageTracing.received(715) -Received response [SaajSoapMessage {http://ynding.com/hr/schemas}HolidayResponse] for request [SaajSoapMessage {http://ynding.com/hr/schemas}HolidayRequest]
2018-02-01 10:21:23 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 10:21:23 [main] INFO org.springframework.oxm.jaxb.Jaxb2Marshaller(518) -Creating JAXBContext with classes to be bound [class com.ynding.User]
2018-02-01 10:21:23 [main] TRACE org.springframework.ws.client.MessageTracing.sent(653) -Sent request [<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><user><id>1</id><name>chenzhouce</name></user></SOAP-ENV:Body></SOAP-ENV:Envelope>]
2018-02-01 10:21:25 [main] DEBUG org.springframework.ws.client.MessageTracing.received(715) -Received response [SaajSoapMessage user] for request [SaajSoapMessage user]
2018-02-01 10:23:12 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 10:23:12 [main] INFO org.springframework.oxm.jaxb.Jaxb2Marshaller(518) -Creating JAXBContext with classes to be bound [class com.ynding.User]
2018-02-01 10:23:12 [main] TRACE org.springframework.ws.client.MessageTracing.sent(653) -Sent request [<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><user><id>1</id><name>chenzhouce</name></user></SOAP-ENV:Body></SOAP-ENV:Envelope>]
2018-02-01 10:25:19 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 10:25:19 [main] INFO org.springframework.oxm.jaxb.Jaxb2Marshaller(518) -Creating JAXBContext with classes to be bound [class com.ynding.User]
2018-02-01 10:25:20 [main] TRACE org.springframework.ws.client.MessageTracing.sent(653) -Sent request [<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><user><id>1</id><name>chenzhouce</name></user></SOAP-ENV:Body></SOAP-ENV:Envelope>]
2018-02-01 10:25:21 [main] DEBUG org.springframework.ws.client.MessageTracing.received(715) -Received response [SaajSoapMessage user] for request [SaajSoapMessage user]
2018-02-01 10:26:31 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 10:26:31 [main] INFO org.springframework.oxm.jaxb.Jaxb2Marshaller(531) -Creating JAXBContext by scanning packages [com.ynding.entity]
2018-02-01 10:26:31 [main] INFO org.springframework.ws.soap.saaj.SaajSoapMessageFactory(139) -Creating SAAJ 1.3 MessageFactory with SOAP 1.1 Protocol
2018-02-01 10:26:31 [main] TRACE org.springframework.ws.client.MessageTracing.sent(653) -Sent request [<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:HolidayRequest xmlns:ns2="http://ynding.com/hr/schemas"><ns2:Holiday><ns2:StartDate>2018-02-01T10:26:31.606+08:00</ns2:StartDate><ns2:EndDate>2018-02-01T10:26:31.606+08:00</ns2:EndDate></ns2:Holiday><ns2:Employee><ns2:Number>1</ns2:Number><ns2:FirstName>yn</ns2:FirstName><ns2:LastName>ding</ns2:LastName></ns2:Employee></ns2:HolidayRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>]
2018-02-01 10:26:32 [main] DEBUG org.springframework.ws.client.MessageTracing.received(715) -Received response [SaajSoapMessage {http://ynding.com/hr/schemas}HolidayResponse] for request [SaajSoapMessage {http://ynding.com/hr/schemas}HolidayRequest]
2018-02-01 10:26:32 [main] TRACE org.springframework.ws.client.MessageTracing.sent(653) -Sent request [<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><HolidayRequest xmlns="http://ynding.com/hr/schemas">
	<Holiday>
		<StartDate>2006-07-03</StartDate>
		<EndDate>2006-07-07</EndDate>
	</Holiday>
	<Employee>
		<Number>42</Number>
		<FirstName>Arjen</FirstName>
		<LastName>Poutsma</LastName>
	</Employee>
</HolidayRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>]
2018-02-01 10:26:32 [main] DEBUG org.springframework.ws.client.MessageTracing.received(715) -Received response [SaajSoapMessage {http://ynding.com/hr/schemas}HolidayResponse] for request [SaajSoapMessage {http://ynding.com/hr/schemas}HolidayRequest]
